"""PATTERN1_PY.py"""
# -*- coding: UTF-8 -*-
__annotations__ = """
 =======================================================
 Copyright (c) 2022-2025
 Author:
     Lisitsin Y.R.
 Project:
     PATTERN_PY
 Module:
     PATTERN1_PY.py

 =======================================================
"""

#------------------------------------------
# БИБЛИОТЕКИ python
#------------------------------------------

#------------------------------------------
# БИБЛИОТЕКИ сторонние
#------------------------------------------

def TEST_01 ():
    """TEST_01"""
#beginfunction
    pass
#endfunction

#------------------------------------------
def main ():
#beginfunction
    TEST_01 ()
#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    main()
#endif

#endmodule
